app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @book = Book.find_by id: params[:id]

INSERT INTO "books" ("photo_url", "title", "author_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["photo_url", "book.jpg"], ["title", "The Title"], ["author_id", 1], ["price", 10], ["created_at", "2016-03-10 05:33:09.439940"], ["updated_at", "2016-03-10 05:33:09.439940"]]
---
  def create
    @book = Book.new
    @book.photo_url = params[:book][:photo_url]
    @book.title = params[:book][:title]
    @book.author_id = params[:book][:author_id]
    @book.price = params[:book][:price]

    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
     @book = Book.find_by id: params[:id]