app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "benny.cazares@gmail.com"]]
---
  def create
   email = params[:email]
   password = params[:password]

   user = User.find_by email: email